Repository: sitalk/Barakcha
Catalog: jrating-5.x-1.0/jrating/po/*.po
Languages: he

source: Display rating form for anonymous users
he: הצג טופס דירוג עבור משתמשים אנונימיים.

source: Should a rating form be present when users aren't logged in?
he: האם להציג טופס דירוג כאשר המשתמשים לא נכנסו למערכת?

source: Display rating form for teasers
he: הצג טופס דירוג לתקצירים

source: Should a rating form be present when only a node teaser is displayed?
he: האם להציג טופס דירוג כאשר רק תקציר התוכן מוצג?

source: Display average rating
he: הצג דירוג משוקלל

source: Should the average rating for an item be displayed?
he: האם להציג דירוג משוקלל לפריט המוצג?

source: Show a rating control
he: הצג לחצן דירוג

source: Yes: display a rating control with nodes of this type
he: כן: הצג לחצן דירוג לפריטי תוכן מסוג זה

source: No: do not display a rating control with nodes of this type
he: לא: אל תציג לחצן דירוג עבור פריטי תוכן מסוג זה

source: Excellent!
he: מצויין!

source: Great!
he: נהדר!

source: Good
he: טוב

source: Quite good
he: די טוב

source: Not so great
he: לא כל כך טוב

source: Rate this
he: דרג זאת

source: Submit
he: שלח

source: Rating saved
he: הדירוג נשמר

source: Unauthorised: please !login to rate items
he: לא מורשה: אנא !הכנס כדי לדרג פריטים

source: login or register
he: כניסה או הרשמה
